# Groupby

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Country' : [ 'USA', 'USA', 'CA', 'CA', 'GBR', 'GBR'],
    'Name' : [ 'Sam', 'Jack', 'Elizabeth', 'Tom', 'Archie', 'Ruby'],
    'Age' :     [ 20, 22, 23, 21, 32, 31]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Country       Name  Age
0     USA        Sam   20
1     USA       Jack   22
2      CA  Elizabeth   23
3      CA        Tom   21
4     GBR     Archie   32
5     GBR       Ruby   31

In [5]:
df.groupby('Country') # output is object

In [6]:
byCountry = df.groupby('Country')

In [7]:
byCountry.mean()

          Age
Country
CA       22.0
GBR      31.5
USA      21.0

In [8]:
byCountry.sum()

         Age
Country
CA        44
GBR       63
USA       42

In [9]:
byCountry.std()

              Age
Country
CA       1.414214
GBR      0.707107
USA      1.414214

In [10]:
byCountry.mean().loc['GBR']

Age    31.5
Name: GBR, dtype: float64

In [11]:
df.groupby('Country').mean().loc['GBR']

Age    31.5
Name: GBR, dtype: float64

In [12]:
df.groupby('Country').count()

         Name  Age
Country
CA          2    2
GBR         2    2
USA         2    2

In [13]:
df.groupby('Country').max() # name orders as a alphabetical order

         Name  Age
Country
CA        Tom   23
GBR      Ruby   32
USA       Sam   22

In [14]:
df.groupby('Country').min()

              Name  Age
Country
CA       Elizabeth   21
GBR         Archie   31
USA           Jack   20

In [15]:
df.groupby('Country').describe()

          Age
        count  mean       std   min    25%   50%    75%   max
Country
CA        2.0  22.0  1.414214  21.0  21.50  22.0  22.50  23.0
GBR       2.0  31.5  0.707107  31.0  31.25  31.5  31.75  32.0
USA       2.0  21.0  1.414214  20.0  20.50  21.0  21.50  22.0

In [16]:
df.groupby('Country').describe().transpose()

Country           CA        GBR        USA
Age count   2.000000   2.000000   2.000000
    mean   22.000000  31.500000  21.000000
    std     1.414214   0.707107   1.414214
    min    21.000000  31.000000  20.000000
    25%    21.500000  31.250000  20.500000
    50%    22.000000  31.500000  21.000000
    75%    22.500000  31.750000  21.500000
    max    23.000000  32.000000  22.000000